Repository: KamiSama-UX/Wedding-hall-APP
Catalog: wedding_hall_app/lib/l10n/intl_*.arb
Languages: ar

source: Email must not be empty
ar: الحساب لا يجب أن يكون فارغ

source: Password must not be empty
ar: كلمة المرور لا يجب أن تكون فارغة

# passwordMoreThanEightCharacters
source: Password must be more than 8 characters
ar: كلمة المرور يجب أن تكون 8 محارف على الأقل

# passwordMustHaveOneCapitalLetter
source: Password must have at least one capital letter
ar: كلمة المرور يجب أن تحتوي على حرف كبير على الأقل

# passwordMustHaveOneSmallLetter
source: Password must have at least one capital letter
ar: كلمة المرور يجب أن تحتوي على حرف صغير على الأقل

# passwordMustHaveOneNumber
source: Password must have at least one number
ar: كلمة المرور يجب أن تحتوي على رقم على الأقل

# passwordMustHaveoneSpecialCharacters
source: Password must have at least one special characters
ar: كلمة المرور يجب أن تحتوي على رمز خاص على الأقل مثل @

# createYourAccountToStartShppoing
source: Create Your Account To Start Shppoing With Asool
ar: أنشئ حسابك لتبدأ بالتسوق مع عسول

# confirmPasswordMustNoBeEmpty
source: Confirm password must not be empty
ar: تأكيد كلمة المرور لا يجب أن تكون فارغة

source: Password not match
ar: كلمة السر غير متطابقة

source: Confirm Password
ar: تأكيد كلمة المرور

source: Let's get started
ar: هيا بنا نبدأ

source: Start With your Al-Asal account
ar: أنشئ حسابك مع العسل

source: Forget Password ?
ar: نسيت كلمة السر ؟

source: Recover it
ar: استعادة

source: Let's Go
ar: هيا بنا

source: Or
ar: أو

source: Sign in with Apple
ar: تسجيل دخول عن طريق أبل

source: Sign in with Google
ar: تسجيل دخول عن طريق غوغل

source: Sign up with email
ar: إنشاء حساب عن طريق البريد الالكتروني

source: Gifts
ar: الهدايا

source: Email
ar: الحساب الالكتروني

source: Password
ar: كلمة السر

source: Number
ar: الرقم

source: Recover Password
ar: استعادة كلمة السر

source: Verify your email
ar: تأكيد حسابك

# EnterTheDigitsVerificationCode
source: Enter the verification code that you received on your email
ar: أدخل كود التحقق الذي وصل إلى حسابك

# fieldMustNotBeNull
source: Field must not be empty
ar: الحقل لا يجب أن يكون فارغ

source: Verifcation code is not completed
ar: كود التفعيل غير مكتمل

source: Send Code
ar: أرسل الكود

source: verify email
ar: أكد حسابك

source: Your Gift Shop
ar: متجرك الأفضل للهدايا

source: Hot Offers
ar: أفضل الخصومات

source: View All
ar: عرض الكل

source: Popular Categories
ar: أصناف شائعة

# popularShops
source: Popular Shpos
ar: متاجر شائعة

source: Hot Gifts
ar: هدايا مميزة

source: Home
ar: الرئيسية

source: Shops
ar: المتاجر

source: products
ar: المنتجات

source: Categories
ar: الفئات

source: Profile
ar: الملف الشخصي

source: Points
ar: النقاط

source: Change Your Password
ar: تغيير كلمة المرور الخاصة بك

source: Order
ar: الطلبات

source: Order List
ar: قائمة الطلبات

source: Theme
ar: الوضع

source: Light Mode
ar: الوضع المضاء

source: Dark Mode
ar: الوضع الداكن

source: Search For Anything
ar: ابحث عن أي شيء

source: Order Detials
ar: تفاصيل الطلب

source: Cancel
ar: إلغاء

source: Confirm
ar: موافق

source: Delete Gift
ar: حذف هدية

# doYouWantToDeleteGiftFromCart
source: Do you want to delete the gift from cart ?
ar: هل تريد حذف الهدية من السلة ؟

source: Name
ar: الأسم

source: Success
ar: تمت العملية بنجاح

# orderIdDoublePoints
source: Order ID :
ar: مُعرف الطلب :

source: Error happened
ar: حدث خطأ

source: OK
ar: موافق

# yourAccountReadyToUse
source: Your account is ready to use
ar: حسابك جاهز للاستخدام

source: Change Password
ar: تغيير كلمة المرور

source: Password Changed Successfly
ar: تم تغيير كلمة المرور بنجاح

# pleaseEnterYourNewPasswordAndConfirmIt
source: Please enter the code and our new password and confirm it
ar: الرجاء إدخال الكود وكلمة المرور الجديدة وتأكيدها

source: Order Now
ar: أطلب الآن

source: Order ID
ar: مُعرف الطلب

source: Gift Description
ar: تفاصيل الهدية

source: Similar Gifts
ar: هدايا مشابهة

# noSearchHistory
source: No History Search
ar: لا يوجد سجل بحث

source: Start Searching To Save History
ar: أبدا البحث الآن

# weCantFindResults
source: We couldn't find any results for:
ar: لم نجد ما تريد البحث عنه :

# weCantFindAny
source: We coudn't find any
ar: لم نجد أياً من

source: added to cart successfully
ar: أُضيف إلى السلة بنجاح

source: My Cart
ar: السلة

source: Your cart is empty
ar: السلة فارغة

source: Please add some gifts to order somthing
ar: يرجى إضافة بعض الهدايا للسلة

source: Gift already exist in the cart
ar: الهدية موجودة مسبقاً في السلة

source: Total Price
ar: السعر الإجمالي

# noSimilarGifts
source: There's no similar gifts for this gift
ar: لا يوجد هدايا مشابهة لهذه الهدية

source: Set Receiver Location
ar: حدد موقع المرسل له

source: Deliver Date
ar: يوم التوصيل

source: Receiver Name
ar: أسم المرسل له

source: Receiver Phone
ar: رقم المرسل له

source: You Should Mark Receiver Location
ar: يجب تحديد موقع المرسل له

source: Next
ar: التالي

source: Order Information
ar: معلومات الطلب

source: No gifts in category called
ar: لا يوجد هدايا في فئة تدعى

source: No categories in shop called
ar: لا يوجد فئات في متجر يدعى

source: Please Try Again ..
ar: الرجاء المحاولة لاحقا

source: There is no hot offer right now
ar: لا يوجد عروض حاليا

source: Payment Success
ar: تمت عملية الدفع بنجاح

source: Payment Failed
ar: فشل عملية الدفع

# youDidntMakeAnyOrder
source: You Didn't make any order until now
ar: لم تقم بأي عملية طلب لحد الآن

source: Contact with as
ar: للتواصل معنا

source: Phone Number
ar: رقم الموبايل

source: Order can't be done
ar: لا يمكن إتمام الطلب

source: No Shops Found
ar: لا يوجد متاجر

source: No Category Found
ar: لا يوجد فئات

source: No hot gifts Found
ar: لا يوجد هدايا مميزة

source: Ordered Gifts
ar: الهدايا المطلوبة

source: Reciver Info
ar: تفاصيل المُرسل إليه

source: Alert
ar: تنويه

# yourAccountIsNotVerified
source: Your account isn't verified
ar: حسابك غير مؤكد

source: Try Again
ar: أعد المحاولة

source: Premium Service
ar: خدمة مميزة

source: Premium Percentage
ar: نسبة خدمة البريميوم

# premiumFeeNote
source: Fee automatically calculated from order total
ar: يتم حساب الرسوم تلقائيًا من إجمالي الطلب

# premiumDateHint
source: Select delivery date (1-2 days)
ar: حدد تاريخ التوصيل (يومين كحد أقصى)

# regularDateHint
source: Select delivery date (3+ days)
ar: حدد تاريخ التوصيل (٣ أيام أو أكثر)

# premiumServiceDesc
source: Get delivery in 1 day (instead of 3) with: • Priority processing • Guaranteed faster delivery • Extra %{{premiumPercentage}} fee
ar: استلم خلال يوم (بدلًا من ٣ أيام) مع: • معالجة أولوية • توصيل أسرع مضمون • رسوم إضافية %{{premiumPercentage}}

source: Origin Price
ar: السعر الابتدائي

source: Final Price
ar: السعر النهائي

source: Language
ar: اللغة

source: Select Language
ar: حدد اللغة

source: Arabic
ar: العربية

source: Logout
ar: تسجيل الخروج

source: English
ar: الانجليزية

source: Yes
ar: نعم

source: No
ar: لا

source: Note
ar: ملاحظات

source: Write any thing in your note
ar: أكتب أي شيء في ملاحظاتك

source: See more
ar: اظهار المزيد

source: See less
ar: تقليص

source: Pricing
ar: التسعير
